src/cf/DataProcessors/УдалениеКонвертации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<DataProcessor>
		<Properties>
			<Name>УдалениеКонвертации</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Конвертация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Конвертации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НепосредственноеУдаление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/Enums/ТипыКонвертаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ТипыКонвертаций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>XML</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>XDTO</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/DataProcessors/УдалениеКонвертации/Ext/ManagerModule.bsl
Процедура ВыполнитьУдалениеПравил(Конвертация, НепосредственноеУдаление, ТолькоВременныеКопии, КоличествоОбъектов, Ошибки) Экспорт
	ЗапросВТ = Новый Запрос;
	ТекстПодзапрос = "
	|ВЫБРАТЬ
	|	Спр.Ссылка КАК Ссылка,
	|	Спр.ПометкаУдаления КАК ПометкаУдаления,
	|	МИНИМУМ(ВЫБОР КОГДА СоставПрочий.Ссылка ЕСТЬ NULL ТОГДА ИСТИНА 
	|			ИНАЧЕ ЛОЖЬ КОНЕЦ) КАК Одиночное
	|ПОМЕСТИТЬ %ИмяВТ%
	|ИЗ Справочник.%ИмяСпр% КАК Спр
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ТекСоставКонвертации
	|ПО ТекСоставКонвертации.ЭлементКонвертации = Спр.Ссылка
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Справочник.СоставыКонвертаций КАК СоставПрочий
	|ПО СоставПрочий.Владелец <> &Конвертация
	|	И СоставПрочий.ЭлементКонвертации = Спр.Ссылка
	|	И СоставПрочий.Отключить = ЛОЖЬ 
	|" + ?(ТолькоВременныеКопии, "ГДЕ Спр.ВременнаяКопия = ИСТИНА ", "") + "
	|СГРУППИРОВАТЬ ПО Спр.Ссылка";

	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	ЗапросВТ.МенеджерВременныхТаблиц = МенеджерВТ;
	ТекстАлгоритмы = СтрЗаменить(ТекстПодзапрос, "%ИмяВТ%", "ТабАлгоритмы");
	ТекстАлгоритмы = СтрЗаменить(ТекстАлгоритмы, "%ИмяСпр%", "Алгоритмы");
	
	ТекстЗапросы = "";
	Если КОнвертация.ТипКонвертации = Перечисления.ТипыКонвертаций.XML Тогда
		ТекстЗапросы = СтрЗаменить(ТекстПодзапрос, "%ИмяВТ%", "ТабЗапросы");
		ТекстЗапросы = СтрЗаменить(ТекстЗапросы, "%ИмяСпр%", "Запросы");
    КонецЕсли;
	
	ТекстПКО = СтрЗаменить(ТекстПодзапрос, "%ИмяВТ%", "ТабПКО");
	ТекстПКО = СтрЗаменить(ТекстПКО, "%ИмяСпр%", "ПравилаКонвертацииОбъектов");

	ТекстПОД = СтрЗаменить(ТекстПодзапрос, "%ИмяВТ%", "ТабПОД");
	ТекстПОД = СтрЗаменить(ТекстПОД, "%ИмяСпр%", "ПравилаОбработкиДанных");
	
	ТекстПКПД = СтрЗаменить(ТекстПодзапрос, "%ИмяВТ%", "ТабПКПД");
	ТекстПКПД = СтрЗаменить(ТекстПКПД, "%ИмяСпр%", "ПравилаКонвертацииПредопределенныхДанных");
	
	ЗапросВТ.Текст = "
	|ВЫБРАТЬ
	|	Ссылка,
	|	ЭлементКонвертации
	|ПОМЕСТИТЬ ТекСоставКонвертации
	|ИЗ Справочник.СоставыКонвертаций
	|ГДЕ Владелец = &Конвертация
	|	И Отключить = ЛОЖЬ
	|;" + ТекстАлгоритмы + "
	|" + ?(ТекстЗапросы = "", "", ";" + ТекстЗапросы) + "
	|;" + ТекстПКО + "
	|;" + ТекстПОД + "
	|;" + ТекстПКПД;
	ЗапросВТ.УстановитьПараметр("Конвертация", Конвертация);
	// Заполнили временные таблицы
	ЗапросВТ.Выполнить();

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = "ВЫБРАТЬ
	|	Ссылка
	|ИЗ Справочник.СоставыКонвертаций
	|ГДЕ Владелец = &Конвертация
	|	И (&РежимУдаления = ИСТИНА ИЛИ НЕ ПометкаУдаления)
	| " + ?(ТолькоВременныеКопии," И ЭлементКонвертации В (ВЫБРАТЬ Ссылка Из ТекСоставКонвертации)","") + "
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	Ссылка
	|ИЗ ТабАлгоритмы
	|ГДЕ Одиночное
	|	И (&РежимУдаления = ИСТИНА ИЛИ НЕ ПометкаУдаления)
	|ОБЪЕДИНИТЬ ВСЕ
	| " + ?(ТекстЗапросы <> "", "ВЫБРАТЬ
	|	Ссылка
	|ИЗ ТабЗапросы
	|ГДЕ Одиночное
	|	И (&РежимУдаления = ИСТИНА ИЛИ НЕ ПометкаУдаления)
	|ОБЪЕДИНИТЬ ВСЕ ", "") + "
	|ВЫБРАТЬ 
	|	Ссылка
	|ИЗ Справочник.ПравилаКонвертацииСвойств
	|ГДЕ Владелец В 
	|		(ВЫБРАТЬ
	|			Ссылка
	|			ИЗ ТабПКО
	|			ГДЕ Одиночное)
	|	И (&РежимУдаления = ИСТИНА ИЛИ НЕ ПометкаУдаления)
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	Ссылка
	|ИЗ ТабПКО
	|ГДЕ Одиночное
	|	И (&РежимУдаления = ИСТИНА ИЛИ НЕ ПометкаУдаления)
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	Ссылка
	|ИЗ ТабПОД
	|ГДЕ Одиночное
	|	И (&РежимУдаления = ИСТИНА ИЛИ НЕ ПометкаУдаления)
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	Ссылка
	|ИЗ ТабПКПД
	|ГДЕ Одиночное
	|	И (&РежимУдаления = ИСТИНА ИЛИ НЕ ПометкаУдаления)
	|";
	Запрос.УстановитьПараметр("Конвертация", Конвертация);
	Запрос.УстановитьПараметр("РежимУдаления", НепосредственноеУдаление);
	Выборка = Запрос.Выполнить().Выбрать();
	КоличествоОбъектов = Выборка.Количество();
	Пока Выборка.Следующий() Цикл
		ТекОбъект = Выборка.ссылка.ПолучитьОбъект();
		Попытка
			Если НепосредственноеУдаление Тогда
				ТекОбъект.Удалить();
			Иначе
				ТекОбъект.УстановитьПометкуУдаления(Истина);
			КонецЕсли;
		Исключение
			Ошибки = Ошибки + Символы.ПС + НСтр("ru='При удалении объекта'") +" " + Выборка.Ссылка + "(" + ТипЗнч(Выборка.Ссылка) + ") "
						+ НСтр("ru='возникла ошибка'")+":" + Символы.ПС + ОписаниеОшибки();
			КоличествоОбъектов = КоличествоОбъектов - 1;
		КонецПопытки;
	КонецЦикла;  
	// Удаление дополнительных модулей
	Если НЕ ТолькоВременныеКопии Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ Ссылка
		|ИЗ Справочник.ДополнительныеМодули
		|ГДЕ Владелец = &Конвертация
		|И (&РежимУдаления = ИСТИНА ИЛИ НЕ ПометкаУдаления)";
		Запрос.УстановитьПараметр("Конвертация", Конвертация);
		Запрос.УстановитьПараметр("РежимУдаления", НепосредственноеУдаление);
		Выборка = Запрос.Выполнить().Выбрать();
		КоличествоОбъектов = КоличествоОбъектов + Выборка.Количество();
		Пока Выборка.Следующий() Цикл
			ТекОбъект = Выборка.ссылка.ПолучитьОбъект();
			Попытка
				Если НепосредственноеУдаление Тогда
					ТекОбъект.Удалить();
				Иначе
					ТекОбъект.УстановитьПометкуУдаления(Истина);
				КонецЕсли;
			Исключение
				Ошибки = Ошибки + Символы.ПС + НСтр("ru='При удалении объекта'") +" " + Выборка.Ссылка + "(" + ТипЗнч(Выборка.Ссылка) + ") "
							+ НСтр("ru='возникла ошибка'")+":" + Символы.ПС + ОписаниеОшибки();
				КоличествоОбъектов = КоличествоОбъектов - 1;
			КонецПопытки;
		КонецЦикла;  
	КонецЕсли;
	Если Ошибки = "" И НЕ ТолькоВременныеКопии Тогда
		ТекОбъект = Конвертация.ПолучитьОбъект();
		Попытка
			Если НепосредственноеУдаление Тогда
				ТекОбъект.Удалить();
			Иначе
				ТекОбъект.УстановитьПометкуУдаления(Истина);
			КонецЕсли;
			КоличествоОбъектов = КоличествоОбъектов + 1;
		Исключение
			Ошибки = Ошибки + Символы.ПС + НСтр("ru='При удалении объекта'") +" " + Конвертация + "(" + ТипЗнч(Конвертация) + ") "
						+ НСтр("ru='возникла ошибка'")+":" + Символы.ПС + ОписаниеОшибки();
		КонецПопытки;
	КонецЕсли;

КонецПроцедуры
